================================================================================
Simple variable assignment
================================================================================

x = 42; x + 1

--------------------------------------------------------------------------------

(source_file
  (let_expression
    (identifier)
    (literal
      (integer_literal))
    (binary_expression
      (identifier)
      (literal
        (integer_literal)))))

================================================================================
Variable assignment with type annotation
================================================================================

x : Nat = 5n; x

--------------------------------------------------------------------------------

(source_file
  (let_expression
    (identifier)
    (natural_type)
    (literal
      (nat_literal))
    (identifier)))

================================================================================
Pattern assignment - tuple
================================================================================

match get_pair(): case (x, y): x + y

--------------------------------------------------------------------------------

(source_file
  (match_expression
    (application_expression
      function: (identifier)
      argument: (unit_literal))
    (match_case
      (pattern
        (tuple_pattern
          (pattern
            (identifier))
          (pattern
            (identifier))))
      (binary_expression
        (identifier)
        (identifier)))))

================================================================================
Pattern assignment - constructor
================================================================================

match maybe_thing(): case @Some{val}: process(val)

--------------------------------------------------------------------------------

(source_file
  (match_expression
    (application_expression
      function: (identifier)
      argument: (unit_literal))
    (match_case
      (pattern
        (constructor_application
          (constructor_tag
            (identifier))
          (identifier)))
      (application_expression
        (identifier)
        (identifier)))))

================================================================================
Variable assignment with complex type annotation
================================================================================

z : Nat = 5n; z + 1n

--------------------------------------------------------------------------------

(source_file
  (let_expression
    (identifier)
    (natural_type)
    (literal
      (nat_literal))
    (binary_expression
      (identifier)
      (literal
        (nat_literal)))))
