================================================================================
Simple fork expression
================================================================================

fork L: a else: b

--------------------------------------------------------------------------------

(source_file
  (fork_expression
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))))

================================================================================
Fork with elif
================================================================================

fork L: a elif: b else: c

--------------------------------------------------------------------------------

(source_file
  (fork_expression
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))))

================================================================================
Fork with multiple elifs
================================================================================

fork L: a elif: b elif: c elif: d else: e

--------------------------------------------------------------------------------

(source_file
  (fork_expression
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))
    (name
      (identifier))))

================================================================================
Fork with complex expressions
================================================================================

fork MyLabel: 
  compute(x)
elif:
  fallback(y)
else:
  default_value

--------------------------------------------------------------------------------

(source_file
  (fork_expression
    (name
      (identifier))
    (application_expression
      function: (name
        (identifier))
      (name
        (identifier)))
    (application_expression
      function: (name
        (identifier))
      (name
        (identifier)))
    (name
      (identifier))))