================================================================================
Simple match expression
================================================================================

match x:
  case @Zero: 0
  case @Succ{pred}: 1 + pred

--------------------------------------------------------------------------------

(source_file
  (match_expression
    (name
      (identifier))
    (match_case
      (pattern
        (constructor_tag
          (identifier)))
      (literal
        (integer_literal)))
    (match_case
      (pattern
        (constructor_application
          (constructor_tag
            (identifier))
          (name
            (identifier))))
      (binary_expression
        (literal
          (integer_literal))
        (name
          (identifier))))))

================================================================================
Match with multiple scrutinees
================================================================================

match a b:
  case 0n 0n: True
  case 1n+a 0n: False
  case 0n 1n+b: False
  case 1n+a 1n+b: eql(a, b)

--------------------------------------------------------------------------------

(source_file
  (match_expression
    (application_expression
      function: (name
        (identifier))
      argument: (name
        (identifier)))
    (match_case
      (pattern
        (literal
          (nat_literal)))
      (pattern
        (literal
          (nat_literal)))
      (literal
        (boolean_literal)))
    (match_case
      (pattern
        (arithmetic_pattern
          (nat_literal)
          (pattern
            (identifier))))
      (pattern
        (literal
          (nat_literal)))
      (literal
        (boolean_literal)))
    (match_case
      (pattern
        (literal
          (nat_literal)))
      (pattern
        (arithmetic_pattern
          (nat_literal)
          (pattern
            (identifier))))
      (literal
        (boolean_literal)))
    (match_case
      (pattern
        (arithmetic_pattern
          (nat_literal)
          (pattern
            (identifier))))
      (pattern
        (arithmetic_pattern
          (nat_literal)
          (pattern
            (identifier))))
      (application_expression
        function: (name
          (identifier))
        (name
          (identifier))
        (name
          (identifier))))))

================================================================================
Match with arithmetic patterns
================================================================================

match n:
  case 0n: zero
  case 1n + m: succ(m)

--------------------------------------------------------------------------------

(source_file
  (match_expression
    (name
      (identifier))
    (match_case
      (pattern
        (literal
          (nat_literal)))
      (name
        (identifier)))
    (match_case
      (pattern
        (arithmetic_pattern
          (nat_literal)
          (pattern
            (identifier))))
      (application_expression
        function: (name
          (identifier))
        (name
          (identifier))))))

================================================================================
If expression
================================================================================

if x:
  True
else:
  False

--------------------------------------------------------------------------------

(source_file
  (if_expression
    (name
      (identifier))
    (literal
      (boolean_literal))
    (literal
      (boolean_literal))))
