================================================================================
Tight function call
================================================================================

f()

--------------------------------------------------------------------------------

(source_file
  (application_expression
    function: (identifier)
    argument: (unit_literal)))

================================================================================
Loose function application to unit
================================================================================

f ()

--------------------------------------------------------------------------------

(source_file
  (application_expression
    function: (identifier)
    argument: (unit_literal)))

================================================================================
Tight list type
================================================================================

A[]

--------------------------------------------------------------------------------

(source_file
  (list_type
    (identifier)))

================================================================================
Loose application to empty list
================================================================================

A []

--------------------------------------------------------------------------------

(source_file
  (list_type
    (identifier)))

================================================================================
Tight type application
================================================================================

f<T,U>

--------------------------------------------------------------------------------

(source_file
  (type_application
    (identifier)
    (identifier)
    (identifier)))

================================================================================
Tight equality predicate
================================================================================

Nat{x == y}

--------------------------------------------------------------------------------

(source_file
  (implicit_application
    (natural_type)
    (binary_expression
      (identifier)
      (identifier))))

================================================================================
Combined tight postfix operations
================================================================================

f<A>(x)[]

--------------------------------------------------------------------------------

(source_file
  (application_expression
    function: (application_expression
      (identifier)
      (identifier)
      (identifier))
    argument: (empty_list)))
